document.addEventListener("DOMContentLoaded", () => {
  const output = document.getElementById("output");
  const sidebar = document.getElementById("sidebar");
  const labButtons = document.querySelectorAll(".lab-buttons button");

  const labData = {
    lab1: [
      {
        title: "Опис предметного середовища",
        content: `<p>Користувачі відкривають головну сторінку, де відображаються актуальні акції та популярні товари. Вони можуть переглядати різні категорії продукції, такі як миші, клавіатури або монітори. Кожен товар представлений із описом, фотографіями, характеристиками.</p>`,
      },
      {
        title: "Тема, мета, місце розташування ЛР №1",
        content: `<p>Тема:<br>
            СТРУКТУРА HTML-ДОКУМЕНТА. ВИБІР ПРЕДМЕТНОЇ ГАЛУЗІ.
            РОБОТА З ПОСИЛАННЯМИ, ТАБЛИЦЯМИ, ЗОБРАЖЕННЯМИ, СПИСКАМИ в HTML-ДОКУМЕНТІ.
            <br>
            Мета:<br>
            придбати практичні навички роботи  з HTML-документом, таблицями, , зображеннями, посиланнями, списками, формами
            Створити шаблон звітного HTML-документом для відображення результатів роботи всіх лабораторних робіт.
            </p>`,
      },
      {
        title: "СТРУКТУРА ДОКУМЕНТА",
        content: '<img src="imglab1/структура.png" />',
      },
      {
        title: "HTML-код ТАБЛИЦЬ",
        content: '<img  src="imglab1/table.png" />',
      },
      {
        title: "HTML-код ФОРМ",
        content: '<img  src="imglab1/form.png" />',
      },
      {
        title: "HTML-код ЗОБРАЖЕННЯ",
        content: '<img  src="imglab1/images.png" />',
      },
      {
        title: "ВИСНОВКИ",
        content: `<p>У ході виконання роботи було придбано практичні навички створення та 
          структурування HTML-документів. Зокрема, була відпрацьована робота з основними 
          елементами веб-сторінки, такими як посилання, таблиці, зображення, списки та 
          форми. Було створено шаблон звітного HTML-документа, який відображає результати 
          виконання лабораторних робіт та може бути використаний для подальших завдань. 
          Цей шаблон слугує основою для представлення інформації у зручному та 
          структурованому вигляді, що сприяє кращому розумінню предметної галузі та 
          ефективній взаємодії з веб-технологіями.</p>`,
      },
    ],
    lab2: [
      {
        title: "Тема, мета ЛР №2 Місце розташування сайту, звіту",
        content: `<p>Тема: <br>
        КАСКАДНІ ТАБЛИЦІ СТИЛІВ. СЕЛЕКТОРИ .ІДЕНТИФІКАТОРИ. СТИЛЬОВЕ ОФОРМЛЕННЯ ТЕКСТОВИХ ЕЛЕМЕНТІВ В HTML-ДОКУМЕНТАХ.
        <br>
        Мета: придбати практичні навички роботи  з селекторами, ідентифікаторами, 
        списками,  різноманітними властивостями кольору і фону,  
        зовнішними та внутрішними  відступами,  плаваючими елементами, 
        оформленням текстових елементів</p>`,
      },
      {
        title: "Способи підключення стилів",
        content: "Тема та мета лабораторної №2",
      },
      {
        title: "Селектори",
        content: "Структура документа для лабораторної №2",
      },
      {
        title: "Селектори тегу",
        content: "Структура документа для лабораторної №2",
      },
      {
        title: "Селектори класу",
        content: "Структура документа для лабораторної №2",
      },
      {
        title: "Селектори ідентифікаторів",
        content: "Структура документа для лабораторної №2",
      },
      {
        title: "Інші селектори",
        content: "Структура документа для лабораторної №2",
      },
      {
        title: "CSS: Шрифти Текст Таблиці Фон Контур Списки CSS Просунутий",
        content: "Структура документа для лабораторної №2",
      },
      {
        title: "Висновки до ЛР №2",
        content: "Структура документа для лабораторної №2",
      },
    ],
  };

  function updateSidebar(labId) {
    sidebar.innerHTML = "";
    const selectedLab = labData[labId];

    selectedLab.forEach((item) => {
      const button = document.createElement("button");
      button.textContent = item.title;
      button.addEventListener("click", () => {
        output.innerHTML = item.content;
      });
      sidebar.appendChild(button);
    });
  }

  labButtons.forEach((button) => {
    button.addEventListener("click", (e) => {
      const labId = e.target.id;
      updateSidebar(labId);
      output.textContent = `Інформація про Лабораторну роботу №${labId.charAt(
        labId.length - 1
      )}`;
    });
  });
});
